[
    {
        "id": 1,
        "imgSrc": "gourmet-burger",
        "title": "Gourmet Burger",
        "description": "Site que apresenta uma franquia de restaurantes baseado num curso da Skillshare. Todo o projeto foi feito utilizando o framework Bootstrap para estilizar a páginas e adicionar comportamentamento. As características mais interessantes do projeto são a responsividade, a presença do carousel, de um menu dropdown e de um modal.",
        "link": "https://github.com/VetVictor33/skillshare-gourmet-burger",
        "mobile": true,
        "keywords": [
            "CSS",
            "HTML",
            "Bootstrap"
        ]
    },
    {
        "id": 2,
        "imgSrc": "rick-morty",
        "title": "Rick and Morty",
        "description": "Projeto realizado durante a jornada fullstack da Samsung Ocean. Estoi foi meu primeiro contato com a biblioteca React.js e com o Express.js.",
        "link": "https://github.com/VetVictor33/ocean-fullstack-express-react",
        "mobile": false,
        "keywords": [
            "CSS",
            "JavaScript",
            "Node",
            "Express",
            "React",
            "MongoDB"
        ]
    },
    {
        "id": 3,
        "imgSrc": "lets-travel",
        "title": "Let's Travel!",
        "description": "Essa aplicação simula um site de reserva de hotéis ao redor do mundo. É possível criar um usuário e fazer reservas que ficarão salvos no banco de dados. Se o usuário for um admin, é possível cadastrar novos hotéis ou deletá-los, visualizar e deletar pedidos de usuários comuns. O backend foi criado utilizando o framework Express, diversos pacotes do node foram adicionados para implementar as funcionalidades do site, como o bcrypt para encryptar a senha dos usuários antes de salvar no banco de dados, que no caso foi o mongoDB, além do pacote express-validator para validação dos dados fornecidos pelo usuário.",
        "link": "https://github.com/VetVictor33/skillshare-hotelpage-full-stack",
        "mobile": true,
        "keywords": [
            "CSS",
            "Pug",
            "JavaScript",
            "Node",
            "Express",
            "MongoDB",
            "Cloudinary"
        ]
    },
    {
        "id": 4,
        "imgSrc": "portfolio-antigo",
        "title": "Portfólio Vanilla JS",
        "description": "Este portfólio, só que desenvolvido em Vanilla JavaScript, e por isso há muita repetição de código HTML, porém o site cumpre o propósito de maneira aceitável. Procurei implementar o conceito de mobile first no CSS, então o design foi iniciado com foco em dispositivos móveis. Utilizei a manipulação da DOM para adicionar itens dinamicamente tendo como referência um array de objetos que simula um JSON coletado de uma API ou backend",
        "link": "https://github.com/VetVictor33/portfolio-programador",
        "deploy": "https://vetvictor33.github.io/portfolio-programador/",
        "mobile": true,
        "keywords": [
            "CSS",
            "HTML",
            "JavaScript"
        ]
    },
    {
        "id": 5,
        "imgSrc": "matching-game",
        "title": "Matching Game",
        "description": "Joguinho feito utilizando React como exercício da Cubos Academy. Foi excelente para praticar useState()!",
        "link": "https://github.com/VetVictor33/cubos-matching-game/blob/main/README.md",
        "deploy": "https://matching-game-idng.onrender.com/",
        "mobile": true,
        "keywords": [
            "CSS",
            "JavaScript",
            "React"
        ]
    },
    {
        "id": 6,
        "imgSrc": "react-music-player",
        "title": "Music Player - React",
        "description": "Tocador de música feito como exercício proposto pela Cubos Academy tendo como referência um arquivo Figma. O maior desafio desse projeto foi combinar o uso de Hooks com a lógica de programação para alcançar os objetivos pretendidos.",
        "link": "https://github.com/VetVictor33/music-player-react",
        "deploy": "https://react-music-player-edv9.onrender.com/",
        "mobile": true,
        "keywords": [
            "CSS",
            "JavaScript",
            "React"
        ]
    }
]
